Reports/ДанныеПоКоманде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ДанныеПоКоманде</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ДанныеПоКоманде/Forms/ФормаОтчета/Ext/Form/Module.bsl
// http://infostart.ru/public/78455/

&НаСервере
Функция ЗапомнитьТекущиеМестаКоманд(ГдеИгра)
	Запрос = Новый Запрос;
	
	//парСТураПоТур = " ";
	//Если Тур1 > 0 И Тур2 > 0 Тогда
	//	парСТураПоТур = "И (Тур МЕЖДУ &Тур1 И &Тур2)";
	//	Запрос.УстановитьПараметр("Тур1", Тур1);
	//	Запрос.УстановитьПараметр("Тур2", Тур2);
	//КонецЕсли;	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Команды.Кто КАК Команда,
	|	КОЛИЧЕСТВО(Игры.Тур) КАК Игр,
	|	СУММА(Игры.ВыигрОборот) КАК Выигр,
	|	СУММА(Игры.НичьиОборот) КАК Ничьи,
	|	СУММА(Игры.ПоражОборот) КАК Пораж,
	|	СУММА(Игры.МЗОборот) КАК МЗ,
	|	СУММА(Игры.МПОборот) КАК МП,
	|	СУММА(Игры.МЗОборот - Игры.МПОборот) КАК РазнМячей,
	|	СУММА(Игры.ОчкиОборот) КАК Очки,
	|	СУММА(Игры.ПОчкиОборот) КАК ПотерОчки
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ИгрыОбщ.Кто КАК Кто,
	|		ИгрыОбщ.Кто.Представление КАК КтоПредставление
	|	ИЗ
	|		РегистрНакопления.Игры КАК ИгрыОбщ
	|	ГДЕ
	|		ИгрыОбщ.Сезон = &Сезон) КАК Команды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Игры.Обороты(
	|				,
	|				,
	|				,
	|				Сезон = &Сезон
	|					И ВЫБОР
	|						КОГДА &Режим = 2
	|							ТОГДА ГдеИгра = 1
	|						КОГДА &Режим = 3
	|							ТОГДА ГдеИгра = 2
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК Игры
	|		ПО Команды.Кто = Игры.Кто
	|
	|СГРУППИРОВАТЬ ПО
	|	Команды.Кто
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очки УБЫВ,
	|	Выигр УБЫВ,
	|	РазнМячей УБЫВ,
	|	МЗ УБЫВ";

	Запрос.УстановитьПараметр("Сезон",	Сезон);
	Запрос.УстановитьПараметр("Режим",	ГдеИгра);

	Результат = Запрос.Выполнить();
	
	Если ГдеИгра = 1 Тогда
		Возврат Результат.Выгрузить();
	Иначе	
		// возвращает массив
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Команда");
	КонецЕсли;	
	
КонецФункции

&НаСервере
// основная процедура
Процедура СформироватьДанныеПоКоманде(Команда, КомандаСоперник = Неопределено) Экспорт 
	
	Макет = Отчеты.ДанныеПоКоманде.ПолучитьМакет("Отчет");
	// для отладки использовать
	//ЭтаОбработка = РеквизитФормыВЗначение("Отчет");	// или этот отчет
	//Макет = ЭтаОбработка.мВернутьМакет();
	
	Запрос = Новый Запрос;
	// нельзя использовать вирт. таблицу оборотов регистра,
	// т.к. при отсутствии результат записей в регистре НЕТ
	// обойти эту проблему
	КоличествоТуров  = 44;	// в сезоне
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Игры.Тур КАК Тур,
	               |	Игры.Дата,
	               |	Игры.СКем,
	               |	Игры.ГдеИгра КАК ГдеИгра,
	               |	Игры.Счет КАК Счет,
	               |	Игры.Выигр КАК Выигр,
	               |	Игры.Ничьи КАК Ничьи,
	               |	Игры.Пораж КАК Пораж,
	               |	Игры.МЗ КАК МЗ,
	               |	Игры.МП КАК МП,
	               |	Игры.Очки КАК Очки,
	               |	Игры.ПОчки КАК ПОчки,
	               |	ВЫБОР
	               |		КОГДА Игры.Тур < &КолКоманд
	               |			ТОГДА 1
	               |		КОГДА Игры.Тур <= (&КолКоманд-1)*2
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК Круг
	               |ИЗ
	               |	РегистрНакопления.Игры КАК Игры
	               |ГДЕ
	               |	Игры.Сезон = &Сезон
	               |	И Игры.Кто = &Команда
	               |	И ВЫБОР
	               |			КОГДА &Режим = 2
	               |				ТОГДА Игры.ГдеИгра = 1
	               |			КОГДА &Режим = 3
	               |				ТОГДА Игры.ГдеИгра = 2
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Круг,
	               |	Тур
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(ГдеИгра),
	               |	СУММА(Счет),
	               |	СУММА(Выигр),
	               |	СУММА(Ничьи),
	               |	СУММА(Пораж),
	               |	СУММА(МЗ),
	               |	СУММА(МП),
	               |	СУММА(Очки),
	               |	СУММА(ПОчки)
	               |ПО
	               |	ОБЩИЕ,
	               |	Круг";
	
	
	Запрос.УстановитьПараметр("Сезон",		Сезон);
	Запрос.УстановитьПараметр("Команда",	Команда);
	Запрос.УстановитьПараметр("КолКоманд",	КолКоманд);
	Запрос.УстановитьПараметр("КолТуров",	КоличествоТуров);
	Запрос.УстановитьПараметр("Режим",		ДВ);
	
	Результат = Запрос.Выполнить();
	тзКоманда = Результат.Выгрузить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|Круг");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Круг");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока|Круг");
	ОбластьИтогКруг = Макет.ПолучитьОбласть("ИтогКруг|Круг");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	ТабДок.Очистить();
	// шапка
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Присоединить(ОбластьШапка);
	
	ОчкиКруг1 = 0; ОчкиКруг2 = 0;
	
	ЦветТени = WebЦвета.СветлоСерый;
	
	облСКем		= ОбластьСтрока.Область("облСКем");
	облСоперник = ОбластьСтрока.Область("облСоперник");
	облСчет		= ОбластьСтрока.Область("облСчет");
	облОчки		= ОбластьСтрока.Область("облОчки");
	облВ		= ОбластьСтрока.Область("облВ");
	облН		= ОбластьСтрока.Область("облН");
	облП		= ОбластьСтрока.Область("облП");

	// ---------------------------------------------------------------------------
	Для стр=1 По КолКоманд-1 Цикл
		Для Круг=0 По 1 Цикл
			// позиционируемся
			НомерТура = Круг*(КолКоманд-1) + стр;
			текТЗ = тзКоманда.Найти(НомерТура, "Тур");
			Если Не текТЗ = Неопределено Тогда
				ГдеИгра = текТЗ.ГдеИгра;
				Тур = текТЗ.Тур;
				СКем = текТЗ.СКем;
				Дата = текТЗ.Дата;
				Счет = обЧислоВСчет(текТЗ.Счет);
				
				_О = текТЗ.Очки;
				_В = текТЗ.Выигр;	_Н = текТЗ.Ничьи; _П = текТЗ.Пораж;
				_МЗ = текТЗ.МЗ; _МП = текТЗ.МП;
				
				ОбластьСтрока.Параметры.Тур = Тур;
				ОбластьСтрока.Параметры.СКем = СКем;
				ОбластьСтрока.Параметры.СКемПолн = СКем;	//.ПолноеНаименование;
				
				облСКем.Примечание = СКем.Наименование;
				
				Если Не КомандаСоперник = Неопределено И СКем <> КомандаСоперник Тогда
					ЦветПобеды		= ЦветТени;
					ЦветНичьи		= ЦветТени;
					ЦветПоражения	= ЦветТени;
					облСоперник.ЦветТекста = ЦветТени;
				Иначе
					ЦветПобеды		= ЦветПобеды;
					ЦветНичьи		= ЦветНичьи;
					ЦветПоражения	= ЦветПоражения;
					облСоперник.ЦветТекста = ?(ГдеИгра=1, ЦветКомандДома, ЦветКомандВыезд);
				КонецЕсли;	
				
				
				ОблВ.ЦветФона = Новый Цвет;
				Если ПустаяСтрока(Счет) Тогда // оставить без раскраски
				ИначеЕсли _В > 0 Тогда
					облВ.ЦветФона = ЦветПобеды;
					облСчет.ЦветТекста = ЦветПобеды;
					облОчки.ЦветТекста = ЦветПобеды;
				ИначеЕсли _Н > 0 Тогда	
					облН.ЦветФона = ЦветНичьи;
					облСчет.ЦветТекста = ЦветНичьи;
					облОчки.ЦветТекста = ЦветНичьи;
				Иначе
					облП.ЦветФона = ЦветПоражения;
					облСчет.ЦветТекста = ЦветПоражения;
					облОчки.ЦветТекста = ЦветПоражения;
				КонецЕсли;	
				
				//облСоперник.ЦветФона
				ОбластьСтрока.Параметры.Счет = Счет;
				ОбластьСтрока.Параметры.Дата = Дата;
				
				Если ПустаяСтрока(Счет) Тогда
					ОбластьСтрока.Параметры.Очки = "";
				ИначеЕсли Круг=0 Тогда
					ОчкиКруг1 = ОчкиКруг1 + _О;
					ОбластьСтрока.Параметры.Очки = ОчкиКруг1;
				Иначе
					ОчкиКруг2 = ОчкиКруг2 + _О;
					ОбластьСтрока.Параметры.Очки = ОчкиКруг2;
				КонецЕсли;
					
				Если Круг=0 Тогда
					ТабДок.Вывести(ОбластьСтрока);
				Иначе
					ТабДок.Присоединить(ОбластьСтрока);
				КонецЕсли;
				
			Иначе	
				
				ОбластьПустаяСтрока.Параметры.Тур = НомерТура;
				Если Круг=0 Тогда
					ТабДок.Вывести(ОбластьПустаяСтрока);
				Иначе
					ТабДок.Присоединить(ОбластьПустаяСтрока);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//итоги общие
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтоги.Следующий();
	
	// итоги за круг
	ВыборкаИтогиКруг = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтогиКруг.Следующий();
	ОбластьИтогКруг.Параметры.Заполнить(ВыборкаИтогиКруг);
	ОбластьИтогКруг.Параметры.ОчкиКруг = ОчкиКруг1;
	ТабДок.Вывести(ОбластьИтогКруг);
	
	ВыборкаИтогиКруг.Следующий();
	ОбластьИтогКруг.Параметры.Заполнить(ВыборкаИтогиКруг);
	ОбластьИтогКруг.Параметры.ОчкиКруг = ОчкиКруг2;
	ТабДок.Присоединить(ОбластьИтогКруг);
	
	текСтрока = МестаКоманд.НайтиСтроки(Новый Структура("Команда", Команда));
	Если текСтрока.Количество() = 0 Тогда
		место = "-"
	Иначе	
		Если ДВ = 1 Тогда
			место = текСтрока[0].МестоВсего;
		ИначеЕсли ДВ = 2 Тогда
			место = текСтрока[0].МестоД;
		Иначе	
			место = текСтрока[0].МестоВ;
		КонецЕсли;
	КонецЕсли;
	
	//
	Если Сезон.флПереходныйСезон Тогда
		//  есть "третий" круг
		ВыборкаИтогиКруг.Следующий();
		ОбластьИтогКруг.Параметры.Заполнить(ВыборкаИтогиКруг);
		
		ПоследнийТурЗаполнен = тзКоманда[тзКоманда.Количество()-1].Тур;
		ПоследнийТурЗаполнен = Мин(ПоследнийТурЗаполнен, КоличествоТуров);
		ЗаполненоТуров = (колКоманд - 1) * 2;
		ОсталосьТуров = ПоследнийТурЗаполнен - ЗаполненоТуров;
		ОсталосьТуровВВкруге = Окр(ОсталосьТуров / 2, 0, РежимОкругления.Окр15как20);
		
		Для стр = 1 По ОсталосьТуровВВкруге Цикл;
			Для Круг=0 По 1 Цикл
				// позиционируемся
				НомерТура = ЗаполненоТуров + Круг*ОсталосьТуровВВкруге + стр;
				текТЗ = тзКоманда.Найти(НомерТура, "Тур");
				Если Не текТЗ = Неопределено Тогда
					ГдеИгра = текТЗ.ГдеИгра;
					Тур = текТЗ.Тур;
					СКем = текТЗ.СКем;
					Дата = текТЗ.Дата;
					Счет = обЧислоВСчет(текТЗ.Счет);
					
					_О = текТЗ.Очки;
					_В = текТЗ.Выигр;	_Н = текТЗ.Ничьи; _П = текТЗ.Пораж;
					_МЗ = текТЗ.МЗ; _МП = текТЗ.МП;
					
					ОбластьСтрока.Параметры.Тур = Тур;
					ОбластьСтрока.Параметры.СКем = СКем;
					ОбластьСтрока.Параметры.СКемПолн = СКем;	//.ПолноеНаименование;
					
					облСКем		= ОбластьСтрока.Область("облСКем");
					облСоперник = ОбластьСтрока.Область("облСоперник");
					облСчет		= ОбластьСтрока.Область("облСчет");
					облОчки		= ОбластьСтрока.Область("облОчки");
					облВ		= ОбластьСтрока.Область("облВ");
					облН		= ОбластьСтрока.Область("облН");
					облП		= ОбластьСтрока.Область("облП");
					
					облСКем.Примечание = СКем.Наименование;
					
					Если Не КомандаСоперник = Неопределено И СКем <> КомандаСоперник Тогда
						ЦветПобеды	= ЦветТени;
						ЦветНичьи	= ЦветТени;
						ЦветПораж	= ЦветТени;
						облСоперник.ЦветТекста = ЦветТени;
					Иначе
						ЦветПобеды	= ЦветКомандВыезд;
						ЦветНичьи	= ЦветНичьи;
						ЦветПораж	= ЦветПоражения;
						облСоперник.ЦветТекста = ?(ГдеИгра=1, ЦветКомандДома, ЦветКомандВыезд);
					КонецЕсли;	
					
					ОблВ.ЦветФона = Новый Цвет;
					Если ПустаяСтрока(Счет) Тогда // нихрена
					ИначеЕсли _В > 0 Тогда
						облВ.ЦветФона = ЦветПобеды;
						облСчет.ЦветТекста = ЦветПобеды;
						облОчки.ЦветТекста = ЦветПобеды;
					ИначеЕсли _Н > 0 Тогда	
						облН.ЦветФона = ЦветНичьи;
						облСчет.ЦветТекста = ЦветНичьи;
						облОчки.ЦветТекста = ЦветНичьи;
					Иначе
						облП.ЦветФона = ЦветПораж;
						облСчет.ЦветТекста = ЦветПораж;
						облОчки.ЦветТекста = ЦветПораж;
					КонецЕсли;	
					
					//облСоперник.ЦветФона
					ОбластьСтрока.Параметры.Счет = Счет;
					ОбластьСтрока.Параметры.Дата = Дата;
					
					Если ПустаяСтрока(Счет) Тогда
						ОбластьСтрока.Параметры.Очки = "";
					ИначеЕсли Круг=0 Тогда
						ОчкиКруг1 = ОчкиКруг1 + _О;
						ОбластьСтрока.Параметры.Очки = ОчкиКруг1;
					Иначе
						ОчкиКруг2 = ОчкиКруг2 + _О;
						ОбластьСтрока.Параметры.Очки = ОчкиКруг2;
					КонецЕсли;
					
					Если Круг=0 Тогда
						ТабДок.Вывести(ОбластьСтрока);
					Иначе
						ТабДок.Присоединить(ОбластьСтрока);
					КонецЕсли;
					
				Иначе	
					
					ОбластьПустаяСтрока.Параметры.Тур = НомерТура;
					Если Круг=0 Тогда
						ТабДок.Вывести(ОбластьПустаяСтрока);
					Иначе
						ТабДок.Присоединить(ОбластьПустаяСтрока);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ТабДок.Вывести(ОбластьИтогКруг);

	КонецЕсли;
		
	ОбластьИтог.Параметры.Заполнить(ВыборкаИтоги);
	ОбластьИтог.Параметры.Место = место;
	ОбластьИтог.Параметры.Очки = ВыборкаИтоги.Очки;
	ТабДок.Вывести(ОбластьИтог);
	
    парКомандаВыбор = Команда;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Сезон.Пустая() Тогда
		Попытка
			Сезон	= Параметры.Сезон;
		Исключение
			Сезон = Константы.ТекущийСезон.Получить();
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		ДВ			= Параметры.ДВ;
	Исключение
		ДВ			= 1;
	КонецПопытки;	
	НачальнаяИнициализация();
	
КонецПроцедуры

&НаСервере
Процедура НачальнаяИнициализация()
	
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Игры.Кто КАК Команда
	|ИЗ
	|	РегистрНакопления.Игры КАК Игры
	|ГДЕ
	|	Игры.Сезон = &Сезон
	|
	|УПОРЯДОЧИТЬ ПО
	|	Игры.Кто.Наименование";
	Запрос.УстановитьПараметр("Сезон", Сезон);
	
	// элементы формы
	СписокВыбора	= Элементы.Команда.СписокВыбора;
	СписокВыбора.Очистить();
	массивК.Очистить();
	
	//МассивК = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Команда");
	Результат = Запрос.Выполнить();
	
	//Для Каждого стр Из МассивК Цикл
	ВыборкаДетали = Результат.Выбрать();
	Пока ВыборкаДетали.Следующий() Цикл
		//СписокВыбора.Добавить(стр.Ссылка);
		Команда = ВыборкаДетали.Команда;
		СписокВыбора.Добавить(Команда);
		массивК.Добавить(Команда);
	КонецЦикла;
	
	Если выбКоманда.Пустая() Тогда
		Попытка
			выбКоманда	= Параметры.Команда;
		Исключение
			выбКоманда = СписокВыбора.Получить(0).Значение;
		КонецПопытки;
	КонецЕсли;
	
	КолКоманд	= массивК.Количество();
	
	// определить текущие места команд 1 раз при открытии
	// и запомнить места в тз
	тзИт = ЗапомнитьТекущиеМестаКоманд(1);
	тзИт.Колонки.Добавить("МестоВсего");
	тзИт.Колонки.Добавить("МестоД");
	тзИт.Колонки.Добавить("МестоВ");
	
	тз2 = ЗапомнитьТекущиеМестаКоманд(2);
	тз3 = ЗапомнитьТекущиеМестаКоманд(3);
	
	Для сч = 0 По тзИт.Количество()-1 Цикл
		тзИт.Получить(сч).МестоВсего = сч + 1;
		
		текСтрока = тзИт.Найти(тз2[сч], "Команда");
		текСтрока.МестоД = сч + 1;
		
		текСтрока = тзИт.Найти(тз3[сч], "Команда");
		текСтрока.МестоВ = сч + 1;
		
	КонецЦикла; 
	
	МестаКоманд.Загрузить(ТзИт);
	
	//Если парКомандаВыбор <> Неопределено Тогда
	//	//индекс 	= МассивК.Найти(парКомандаВыбор);
	//	//Команда	= МассивК.Получить(индекс);
	//	выбКоманда = парКомандаВыбор
	//КонецЕсли;
	
	КомандаСоперник = ?(Параметры.Свойство("КомандаСоперник"), Параметры.КомандаСоперник, Неопределено);
	
	ЗаполнитьРеквизитыОформленияСтрокНаФорме();
	
	СформироватьДанныеПоКоманде(выбКоманда, КомандаСоперник);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// вывести историю взаимоотношений между командами
	СтандартнаяОбработка = Ложь;
	стрЗаголовок = "";
	
	МатчСыгран = Истина;
	// так нельзя получить область в текущей строке
	// МатчСыгран = ЗначениеЗаполнено(ТабДок.Области.облСчет.Текст);
	ТабДокР = омВызовИзКлиента.обИнфо(выбКоманда, Расшифровка, МатчСыгран, стрЗаголовок);
	
	ТабДокР.ОтображатьСетку = Ложь;
	ТабДокР.ОтображатьЗаголовки = Ложь;
	ТабДокР.ТолькоПросмотр = Истина;
	ТабДокР.Показать(стрЗаголовок)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СформироватьДанныеПоКоманде(выбКоманда)
КонецПроцедуры

&НаКлиенте
Процедура Предыдущая(Команда)
	стр		= МассивК.Индекс(МассивК.НайтиПоЗначению(выбКоманда));
	индекс	= ?(стр=0, КолКоманд-1, стр-1);	// 0..КолКоманд-1
	выбКоманда	= МассивК.Получить(индекс).Значение;
	СформироватьДанныеПоКоманде(выбКоманда)
КонецПроцедуры

&НаКлиенте
Процедура Следующая(Команда)
	стр		= МассивК.Индекс(МассивК.НайтиПоЗначению(выбКоманда));
	индекс	= ?(стр=КолКоманд-1, 0, стр+1);	// 0..КолКоманд-1
	выбКоманда	= МассивК.Получить(индекс).Значение;
	СформироватьДанныеПоКоманде(выбКоманда);
КонецПроцедуры

&НаКлиенте
Процедура ДВПриИзменении(Элемент)
	СформироватьДанныеПоКоманде(выбКоманда)
КонецПроцедуры

&НаКлиенте
Процедура СезонПриИзменении(Элемент)
	// собрать снова массив команд
	НачальнаяИнициализация();	
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	СформироватьДанныеПоКоманде(выбКоманда);
	флИзменениеЦвета = Истина
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыОформленияСтрокНаФорме()

	//ОбъектДанные = ДанныеФормыВЗначение(Отчет, Тип("ПланВидовХарактеристикОбъект.ПланВидовХарактеристик1"));
	//ЗначениеИзХранилища = ОбъектДанные.ЦветПобеды.Получить();
	//ЦветПобеды = ЗначениеИзХранилища;
	
	//УсловноеОформление.Элементы
	
	стНастройкиЦвета = Константы.хзЦвета.Получить().Получить();
	
	Если Не стНастройкиЦвета = Неопределено И ТипЗнч(стНастройкиЦвета)=Тип("Структура") Тогда
		
		ЦветПобеды		= стНастройкиЦвета.ЦветПобеды;
		ЦветНичьи		= стНастройкиЦвета.ЦветНичьи;
		ЦветПоражения	= стНастройкиЦвета.ЦветПоражения;
		
		ЦветКомандДома	= стНастройкиЦвета.ЦветКомандДома;
		ЦветКомандВыезд	= стНастройкиЦвета.ЦветКомандВыезд;
		
	Иначе
		
		ЦветПобеды		= WebЦвета.ЦветМорскойВолныНейтральный;	//WebЦвета.Красный;
		ЦветНичьи		= WebЦвета.Оранжевый;					//WebЦвета.Зеленый;
		ЦветПоражения	= WebЦвета.Кирпичный;					//WebЦвета.СветлоГрифельноСиний;
		
		ЦветКомандДома	= WebЦвета.Оранжевый;
		ЦветКомандВыезд	= WebЦвета.ЗеленыйЛес;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если флИзменениеЦвета Тогда
	
		//ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект));	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	// вопрос
	Если Вопрос("Изменились настройки цвета. Сохранить", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
		СохранитьНастройкиЦвета(Неопределено)
	КонецЕсли;

КонецПроцедуры
  
  &НаСервереБезКонтекста
Процедура СохранитьНастройкиЦветаНаСервере(стНастройкиЦвета)
	
	//Сжатие = Новый СжатиеДанных(9); 
	//Хранилище = Новый ХранилищеЗначения(ТЗ,Сжатие);  
	// 
	ХранилищеЗначения	= Новый ХранилищеЗначения(стНастройкиЦвета);
	Константы.хзЦвета.Установить(ХранилищеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиЦвета(Команда)
	
	стНастройкиЦвета = Новый Структура;
	
	стНастройкиЦвета.Вставить("ЦветПобеды", ЦветПобеды);
	стНастройкиЦвета.Вставить("ЦветНичьи", ЦветНичьи);
	стНастройкиЦвета.Вставить("ЦветПоражения", ЦветПоражения);
	
	стНастройкиЦвета.Вставить("ЦветКомандДома", ЦветКомандДома);
	стНастройкиЦвета.Вставить("ЦветКомандВыезд", ЦветКомандВыезд);

	СохранитьНастройкиЦветаНаСервере(стНастройкиЦвета);
	флИзменениеЦвета = Ложь
	
КонецПроцедуры
